#include <stdlib.h>
#include <stdio.h>

#include "../game_type.h"
#include "../xyj2_func.h"
#include "../game_wave.h"

/*
*===================================================
*					ÓÎÏ·µÀ¾ßÏà¹Ø
*===================================================
*/

/*
*
*
*
*
*/

const char *ItemName[]={
"ÎÞµÀ¾ß",
"½ð¹¿¹÷","Í¨Ìì¹÷","ó´ÁúÆÆÑÒ¹÷","Ë«Á¶Éñ°ô","ÁùÂÖÁÒÈÕ¹÷","Ììî¸¹÷","³¬´óÊ¥","²»¶¯Áú¹÷","Ô³ÉñÇæÌìÖù",
"¾Å³Ý","ÑýÄ§âã","Òì½çÂÖ»Ø","ÉñÊÞÑÀ","ËÄ¼¾¶¤ôÎ","µØÉ·ÐÇ","Óü³Ý","Ìì·£¶¤","¾Þëà¶¤",
"½µÄ§±¦èÆ","ºÚºÓÔÂÑÀ²ù","½ð¸Õ","±±³½","Ë®ÑýÔÂÑÀ","½µÄ§½ð¸ÕèÆ","º®±ù¶³¾µ²ù","ÌìÀÇ","ÎÞ³£",
"·½Ìì","°ÔÆøÇ¹","Ê®×ÖÌìÂÖ","¾Ô·êÅôÒíÇ¹","°Ë·½ÌìÍâ","ÒíÓ°Ç¹","Ð¥ÌìÊ®×ÖÇ¹","Ê¥¾ýÊ®×ÖÂÖ","½¹Ñ×¾øÒíÇ¹",
"¼²·çÁ­","ÁúÉñ×¦ÆÆ","ÁúÁÛÇÐ","ÌìÄ§Ë«ÈÐÈÐ","´óÐý·ç","åÈÂÞÇÐ","÷Ò÷ÑÎÞÓ°×¦","ÀäÒíË«ÈÐ","°×ÁúË«ÒíÈÐ",
"ÌúÉÈ","°Å½¶ÉÈ","·ï»ËÑæÓðÉÈ","Çå·çÉÈ","ÈçÒâ±¦ÉÈ","ÒõÑôÆÖÉÈ","ÃÖÀÕÏ²¸£ÉÈ","Ð×ÄñÓðÉÈ","½ðÓðÉ¢³áÉÈ",
"ÎÞÃû½£","×Ïµû","±ÙÐ°½£","¹â°ÔÌì","×ÏÉ°½£","Äµµ¤","°Ë°ÙÒø»¨","ÇÐ¹â","ÆßÐÇÁúÔ¨",
"Ìì¹¬É¡","°Ë±¦É¡","ÌìÉ¡¡¤ÏÒÔÂ","ÁéÆø±¦É¡","ÎåÉ«É¡","ÌìÉ¡¡¤ÂúÔÂ","»¨ºÃÔÂÔ²","ÔÂÏÂÎèÉ¡","ÑýÉ¡¡¤µþÓê",
"¾ÅÎý","±¦ÂÖ","·ð¹â±éÕÕ","ÐéÎÞ","°ËÊ®°Ë·ð","´ó¼«ÀÖ","ËÄ´ó½Ô¿Õ","Òò¹û","ÏÈÖª",
"Ö©ÖëÑÀ","ÀÇÖ©ÖëÑÀ","×ïÖ®Ò»·½","Áã¶ÈÖ®ÎÇ","²òÀÇ×¦ÑÀ","ÑªÐÈÊçÅ®","ºÚ¹Ñ¸¾","ÔÖº¦","ò¿ÓÈ¹íÊÖ",
"Í¨Ìì¹Ú","»ÆÅÛ¹Ú","ËÀ¹Ç·¢ÊÎ","ÐþÎä¹Ú","÷è÷ë¹Ú","·ïÇý¹Ú","Á§¹Ú","Ìì±¬ËéÑ×¹Ú","ÑÖÍõ¹Ú","ÂåÉñ¹Ú","ÇåÐÄ×Ï½ð´ø",
"»¤·¨ôÂôÄ","ÐÞÂÞÕ½ÒÂ","ÂÞ„x²¼×º","»¯¾¢ÃÞÒÂ","±Ù»ðÉÀ","ÁúÍõÄæÁÛ¼×","³¤ÉúÏÉÅÛ","¿ñÅ£Õ½¿ø","ÎÞË«Ó¢ÐÛ","¾ø´ú¼ÑÈË","×Ï½ð°ËØÔ¾µ",
"»¢Æ¤Ñü´ø","÷¼÷ÃÑü´ø","¼²·çÑü´ø","ÐÇËÞÑü´ø","ÔÂÂÖÑü´ø","ÈÕÂÖÑü´ø","¼«Ê×Éß","²»´ÝÑü´ø","·üôËÑü´ø","Å®æ´Ñü´ø","·çÉñ»·","ÇåÐÄÎ§Ñü",
"»þÐÇ¹Ú","Óù·çÁ¶¼×","Õò·ç´ø",
"³½É°¹Ú","Î¢³¾¼×","ÐþÊ¯ÂÄ",
"Òµ»ð¹Ú","½¹Ñ×ÊÀ½ç","ÁùµÀ½Ù»ð»·",
"ËªÁ«Â¶Óêô¢","±¡ÎíÏÉÒÂ","±ùÖÖ»·",
"µÄÂ¿Õ½¿ø","×¦»Æ·Éµç","³àÁú¾ÔÌã",
"ôä´äÃ÷¹Ú","çúçêÈíÓñÅÛ","ÎåÉ«ÁðÁ§Ñ¥",
"Å£Ä§Íõ","½ð½Ç","Òø½Ç","°×¹Ç¾«","»ÆÅÛÀÏ¹Ö","»¢Á¦ÏÉ","ÑòÁ¦ÏÉ","Â¹Á¦ÏÉ",
"½ðÓã¾«","Áù¶úâ¨ºï","ºìº¢¶ù","´óÅôÍõ","°×ÏóÍõ","ÇàÊ¨Íõ","Ð«×Ó¾«","Ð¡°×Êó","Ð¡ÃÛ·ä",
"±ù¼ýÊõ","×êÊ¯³¾","ÑÖÍõÍÂÏ¢",
"»ðº£Êõ","Á÷ÐÇÓê","Ìì·£",
"À×Ö®Ç½","À×Éñ½ø¾ü","Ê¥²ÃÖ®Ç½",
"»ØÍ·ÊÇ°¶","Òý¶ÉÎ÷·½","ÓÀ½ÙÂÖ»Ø",
"Éñ¹âÊõ","ÉñÍþ¹âÁ¬´ò","±äÒìÖ®¹â",
"¾ÞÁéÕÙ»Ã","¾ÞÁéÖ®Å­","ÖîÉñÖ®Îè",
"×·»êµ¶","ÕðµØµ¯","ÂÒÐÄÑÌ","ÎåÀ×·û","»¯¶¾²Ý","ÍòÓ¦µ¤","ÉÏ¹ÅÁúµ°","¹í·äÎÑ","É¢»¨ïÚ","ÕðÌìÀ×","³ÝÂÖ",
"»Ï½ðÉþ","×Ï½ðºùÂ«","°×ÓñÓÛ","ÈËÖÖ´ü","ÀäÁúÁî","ÎåÐÐ³µ","ÒõÑô¶þÆøÆ¿","µ¹Âí¶¾×¯",
"×Ï½ðÁå","ÕÙÀ×ÁîÅÆ","À×¹«´¸","ÁáççËþ","¶¨·çÖé","·ç´ü","Âä±¦½ðÇ®","ÉñÁé»¤Éí·û","ËÄº£Æ¿",
"¾ÅÌìÐþ±ùÉÈ","Îå»ðÉñÑæÉÈ","Ìì½«Áî",
"ÄùÅÌ¾­","ÎåÁú¾­","Î¬Ä¦¾­","½ð¸Õ¾­","·¨»ª¾­"
};






//0x1004E85A µ¥¸öµôÂä¼Ó·Ö²¹ÑªÎïÆ·
void __fastcall DropFoodA(__int16 x, __int16 y, __int16 a3, int id, __int16 a5, __int16 a6)
{
	int OBJ; // [sp+8h] [bp-28h]@11

	if ( g_MAIN_FSM != 2 && id > 0x8000 && id < 0x8020 )
	{
		if ( x >= gDstX + 33 )
		{
			if ( x > gDstX + 416 )
				x = gDstX + 416;
		}
		else
		{
			x = gDstX + 33;
		}
		if ( y > gDstY + 224 )
			y = gDstY + 210;
		OBJ = CreatFoodObj(x, y, a3, id, a5);
		if ( OBJ )
			*(_WORD *)(OBJ + 104) = a6;
	}
}

//0x1004E8FA µôÂä¶à¸ö¼Ó·Ö²¹ÑªÎïÆ·
void __fastcall DropFoodB(__int16 x, __int16 y, __int16 a3, int id, __int16 a5, __int16 a6, __int16 a7, __int16 a8)
{
	int OBJ; // [sp+8h] [bp-28h]@11

	if ( g_MAIN_FSM != 2 && id > 0x8000 && id < 0x8020 )
	{
		if ( x >= gDstX + 33 )
		{
			if ( x > gDstX + 416 )
			x = gDstX + 416;
		}
		else
		{
			x = gDstX + 33;
		}
		if ( y > gDstY + 224 )
			y = gDstY + 210;
		OBJ = CreatFoodObj(x, y, a3, id, a5);
		if ( OBJ )
		{
			if ( a6 )
			{
				*(_WORD *)(OBJ + 230) = a6;
				*(_WORD *)(OBJ + 114) = 1;
			}
			*(_WORD *)(OBJ + 12) = a7;
			*(_WORD *)(OBJ + 14) = 0;
			*(_WORD *)(OBJ + 104) = a8;
		}
	}
}

//0x10098BBE µôÂäµ¥¸öµÀ¾ß
void __fastcall DropItemA(__int16 x, __int16 y, __int16 a3, int id, int a5, __int16 a6, __int16 a7, __int16 a8)
{
	int OBJ; // r4@12
	
	if ( g_MAIN_FSM != 2 && id && id < 214 )
	{
		if ( x >= gDstX + 33 )
	{
	if ( x > gDstX + 416 )
		x = gDstX + 416;
	}
	else
	{
		x = gDstX + 33;
	}
	if ( y > gDstY + 224 )
		y = gDstY + 210;
	OBJ = CreatItemObj(x, y, a3, id, 1, a5, a6, a7);
	if ( OBJ )
		*(_WORD *)(OBJ + 104) = a8;
	}
	pgm2log("µôÂä±¦Îï -> %s\n",ItemName[id]);
}